# SpaceElecEquipmentRadiantPercentageParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceElecEquipmentRadiantPercentageParam Property
ParameterTypeId Class See Also
---
"Electrical Equipment Radiant"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceElecEquipmentRadiantPercentageParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceElecEquipmentRadiantPercentageParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceElecEquipmentRadiantPercentageParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace